#include <stdio.h>

int main_m_array(void) {
	// 다차원 배열 Multidimensional Array
	/*int i; // □

	int arr[5]; // □□□□□

	int arr2[2][5]; // 5개의 공간을 가진 배열이 2개 있다.
	// □□□□□
	// □□□□□

	int arr3[4][2]; // 2개의 공간을 가진 배열이 4개 있다.
	// □□
	// □□
	// □□
	// □□

	// 3차원 배열도 가능하다.
	int arr3[3][3][3];
	// □□□
	// □□□
	// □□□

	// □□□
	// □□□
	// □□□

	// □□□
	// □□□
	// □□□


	// 다차원 배열을 선언
	int arr2[2][5] = { 
		{ 1, 2, 3, 4, 5 }, 
		{ 1, 2, 3, 4, 5 } 
	};
	int arr3[4][2] = { 
		{1, 2},
		{1, 2}, 
		{1, 2},
		{1, 2} 
	};
	int arr4[3][3][3] = {
		{ 
			{ 1, 2, 3 },
			{ 1, 2, 3 }, 
			{ 1, 2, 3 } 
		},
		{ 
			{ 1, 2, 3 }, 
			{ 1, 2, 3 }, 
			{ 1, 2, 3 } 
		},
		{ 
			{ 1, 2, 3 }, 
			{ 1, 2, 3 }, 
			{ 1, 2, 3 } 
		}
	};*/



	return 0;
}